name: "model_det"
platform: "onnxruntime_onnx"
max_batch_size: 0

input {
  name: "images"
  data_type: TYPE_FP32
  dims: [3, 640, 640] 
}

output {
  name: "output0"
  data_type: TYPE_FP32
  dims: [5, -1] 
}

dynamic_batching {
  preferred_batch_size: [1, 2, 4, 8, 16, 20]
  max_queue_delay_microseconds: 500
}

instance_group {
  kind: KIND_GPU
  count: 1
}